{
  "header.name": "Iago Alves",
  "header.role": "Software Engineer",
  "header.aria.backToHome": "Back to home",
  "header.aria.toggleTheme": "Toggle theme",
  "header.aria.viewProjects": "View projects",
  "header.aria.viewAbout": "View about page",
  "header.aria.toggleLang": "Toggle language",
  "nav.projects": "Projects",
  "nav.about": "About",

  "home.intro": "Junior Software Engineer based in Belo Horizonte, finishing my degree in Information Systems at UFMG. Currently working at Group Software, focusing on backend development and system integrations with .NET, C#, Java, and Spring Boot. Passionate about building robust solutions and always eager to learn and take on new challenges.",
  "home.downloadCV": "Download my CV",
  "home.online": "Online",
  "home.contactEmail": "iagoalves.voador@gmail.com",
  "external.linkedin": "follow my career",
  "external.github": "view my code",

  "timeline.item1.title": "Information Systems",
  "timeline.item1.subtitle": "UFMG",
  "timeline.item1.period": "2022 - Present",
  "timeline.item2.title": "Project Analyst",
  "timeline.item2.subtitle": "Pi Júnior - UFMG",
  "timeline.item2.period": "2024 - 2025",
  "timeline.item3.title": "Intern",
  "timeline.item3.subtitle": "Group Software",
  "timeline.item3.period": "2024 - 2025",
  "timeline.item4.title": "Software Engineer",
  "timeline.item4.subtitle": "Group Software",
  "timeline.item4.period": "2026 - Present",

  "projects.title": "Projects",
  "projects.visitWebsite": "Visit website",
  "projects.viewOnGitHub": "View on GitHub",

  "projects.picodohorizonte.description": "Backend application for a craft beverages portfolio, enabling administrative management of products, categories, and related content. Designed to support an admin dashboard with secure control over catalog data and business rules.",
  "projects.wifi-bh.description": "Web application for managing public Wi-Fi points in Belo Horizonte. Users can add new points, rate existing ones with stars, import data from PBH CSV files, and view all registered points with coordinates and ratings.",
  "projects.bustracker.description": "Real-time bus tracking system for Belo Horizonte, using public API data from PBH (Prefeitura de Belo Horizonte). It includes a REST API for querying stops, lines and arrival predictions, a background worker for collecting real-time bus positions, and a GTFS data importer.",
  "projects.investimentos.description": "A RESTful API for managing financial investments. Allows registering investments, calculating estimated returns, and viewing dashboards with summaries and charts.",
  "projects.our-places.description": "A Java backend API built with Spring for relationship management. Designed for couples, it allows saving and rating visited places, storing important dates, and managing shared memories.",
  "projects.race-manager-api.description": "A Java backend API built with Spring for race management. Designed for organizers, it allows creating championships and categories, adding participants, recording finish times, and accessing results.",
  "projects.user-service.description": "A backend application for user registration built with a microservices architecture. It includes a User Service to handle new user creation and an Email Service to send a welcome notification upon successful registration.",
  "projects.huffman.description": "The project is a program designed to reduce the size of text files using the Huffman compression algorithm. It builds a Huffman tree based on character frequency, encoding frequent characters with shorter binary codes. The program supports both compression and decompression of text files.",
  "projects.convex-hull.description": "This C++ project processes 2D point data to compute the convex hull of a point set using Graham's or Jarvis's algorithms. Points are read from a text file, and for Graham's method, the user can choose between InsertionSort, MergeSort, or BucketSort.",
  "projects.p2p-chat.description": "This project implements a distributed P2P chat system using a blockchain-inspired consensus mechanism to ensure message history integrity and ordering across network nodes. The entire application was developed in Python, leveraging the asyncio library for asynchronous handling of concurrent network connections.",
  "projects.math-expressions.description": "The project is a C++ implementation of a mathematical expression calculator. It includes features for validating and solving complex expressions in both infix and postfix notation. The program can handle parentheses, multiple operators and operands, and expressions up to 1000 characters. It verifies expression validity, converts between notations, and solves them using a simple interface.",
  "projects.rip-over-udp.description": "The project is a dynamic routing system based on the RIP protocol over UDP, developed in Python to simulate real routing behavior between multiple routers.",

  "about.title": "About me",
  "about.p1": "I live in Belo Horizonte, MG. I've always been passionate about sports, having competed in mountain biking and motocross, which taught me a lot about discipline and perseverance.",
  "about.p2": "Since a young age, I've been fascinated by computers and technology. My natural curiosity and enjoyment in solving problems led me to pursue a career in this field.",
  "about.p3": "I'm currently finishing my Information Systems degree at Federal University of Minas Gerais (UFMG). My academic journey has given me a strong foundation in software development.",
  "about.p4": "My professional path began at Pi Júnior, where I worked for a year. As a Project Analyst, I had the opportunity to dive into full-stack development with Python, build dashboards, automate processes, manage projects, and interact directly with clients.",
  "about.p5": "I then joined Group Software as a Software Development Intern, focusing on backend and system integrations. After my internship, I was promoted to Junior Software Engineer, where I continue working on maintaining and evolving complex systems, developing new features, and fixing bugs using technologies like .NET, C#, Java, Spring Boot, and SQL Server.",
  "about.p6": "I'm a growing professional who proactively seeks new challenges, constantly improving my skills through study and personal projects.",
  "about.p7": "If you'd like to get in touch, find me on LinkedIn or send me an email at iagoalves.voador@gmail.com.",
  "about.signoff": "Best regards, Iago",

  "notfound.title": "This page doesn't exist.",
  "notfound.homeLink": "Take me home, country road..."
  ,
  "scroll.backToTop": "Back to top",
  "scroll.aria.scrollToTop": "Scroll to top"
  ,
  "footer.code": "Code",
  "footer.quote": "One thing at a time :)"
}
