{
  "header.name": "Iago Alves",
  "header.role": "Desenvolvedor de Software",
  "header.aria.backToHome": "Voltar para a página inicial",
  "header.aria.toggleTheme": "Alternar tema",
  "header.aria.viewProjects": "Ver projetos",
  "header.aria.viewAbout": "Ver sobre",
  "header.aria.toggleLang": "Alternar idioma",
  "nav.projects": "Projetos",
  "nav.about": "Sobre",

  "home.intro": "Desenvolvedor de Software Júnior morando em Belo Horizonte, cursando Sistemas de Informação na UFMG. Atualmente trabalho na Group Software, focado em desenvolvimento backend e integrações de sistemas com .NET, C#, Java e Spring Boot. Apaixonado por construir soluções robustas e sempre disposto a aprender e enfrentar novos desafios.",
  "home.downloadCV": "Currículo",
  "home.online": "Online",
  "home.contactEmail": "iagoalves.voador@gmail.com",
  "external.linkedin": "acompanhe minha carreira",
  "external.github": "veja meu código",

  "timeline.item1.title": "Sistemas de Informação",
  "timeline.item1.subtitle": "UFMG",
  "timeline.item1.period": "2022 - Presente",
  "timeline.item2.title": "Analista de Projetos",
  "timeline.item2.subtitle": "Pi Júnior - UFMG",
  "timeline.item2.period": "2024 - 2025",
  "timeline.item3.title": "Estagiário",
  "timeline.item3.subtitle": "Group Software",
  "timeline.item3.period": "2024 - 2025",
  "timeline.item4.title": "Desenvolvedor de Software",
  "timeline.item4.subtitle": "Group Software",
  "timeline.item4.period": "2026 - Presente",

  "projects.title": "Projetos",
  "projects.visitWebsite": "Visitar site",
  "projects.viewOnGitHub": "Ver no GitHub",

  "projects.picodohorizonte.description": "Aplicação backend para um portfólio de bebidas artesanais, permitindo gestão administrativa de produtos, categorias e conteúdo relacionado. Projetada para suportar um painel administrativo com controle seguro sobre dados do catálogo e regras de negócio.",
  "projects.wifi-bh.description": "Aplicação web para gerenciar pontos de Wi-Fi público em Belo Horizonte. Usuários podem adicionar novos pontos, avaliar os existentes com estrelas, importar dados de arquivos CSV da PBH e visualizar todos os pontos registrados com coordenadas e avaliações.",
  "projects.bustracker.description": "Sistema de rastreamento de ônibus em tempo real para Belo Horizonte, utilizando dados de API pública da PBH (Prefeitura de Belo Horizonte). Inclui uma API REST para consultar pontos, linhas e previsões de chegada, um worker em background para coletar posições em tempo real e um importador de dados GTFS.",
  "projects.investimentos.description": "API RESTful para gerenciar investimentos financeiros. Permite registrar investimentos, calcular retornos estimados e visualizar dashboards com resumos e gráficos.",
  "projects.our-places.description": "API backend Java construída com Spring para gerenciamento de relacionamentos. Projetada para casais, permite salvar e avaliar lugares visitados, armazenar datas importantes e gerenciar memórias compartilhadas.",
  "projects.race-manager-api.description": "API backend Java construída com Spring para gestão de corridas. Projetada para organizadores, permite criar campeonatos e categorias, adicionar participantes, registrar tempos de chegada e acessar resultados.",
  "projects.user-service.description": "Aplicação backend para cadastro de usuários construída com arquitetura de microsserviços. Inclui um User Service para criar novos usuários e um Email Service para enviar notificação de boas-vindas após o registro.",
  "projects.huffman.description": "Projeto para reduzir o tamanho de arquivos de texto usando o algoritmo de compressão de Huffman. Constrói uma árvore de Huffman baseada na frequência de caracteres, codificando caracteres frequentes com códigos binários curtos. Suporta compressão e descompressão de arquivos de texto.",
  "projects.convex-hull.description": "Projeto em C++ que processa pontos 2D para calcular o casco convexo (convex hull) de um conjunto de pontos utilizando os algoritmos de Graham ou Jarvis. Os pontos são lidos de um arquivo de texto e, no método de Graham, o usuário pode escolher entre InsertionSort, MergeSort ou BucketSort.",
  "projects.p2p-chat.description": "Projeto que implementa um sistema de chat P2P distribuído usando um mecanismo de consenso inspirado em blockchain para garantir integridade e ordenação do histórico de mensagens entre nós da rede. Desenvolvido em Python, usando asyncio para tratamento assíncrono de conexões de rede concorrentes.",
  "projects.math-expressions.description": "Implementação em C++ de uma calculadora de expressões matemáticas. Inclui validação e resolução de expressões complexas em notação infixa e posfixa, suporte a parênteses, múltiplos operadores e operandos, e expressões de até 1000 caracteres.",
  "projects.rip-over-udp.description": "Sistema de roteamento dinâmico baseado no protocolo RIP sobre UDP, desenvolvido em Python para simular o comportamento de roteamento real entre múltiplos roteadores.",

  "about.title": "Sobre mim",
  "about.p1": "Moro em Belo Horizonte, MG. Sempre fui apaixonado por esportes, tendo competido em mountain bike e motocross, o que me ensinou muito sobre disciplina e perseverança.",
  "about.p2": "Desde jovem, sempre fui fascinado por computadores e tecnologia. Minha curiosidade e prazer em resolver problemas me levaram a seguir carreira nessa área.",
  "about.p3": "Atualmente estou finalizando o curso de Sistemas de Informação na Universidade Federal de Minas Gerais (UFMG). Minha trajetória acadêmica me deu uma base sólida em desenvolvimento de software.",
  "about.p4": "Minha trajetória profissional começou na Pi Júnior, onde trabalhei por um ano. Como Analista de Projetos, tive a oportunidade de atuar com desenvolvimento full-stack em Python, construir dashboards, automatizar processos, gerenciar projetos e interagir diretamente com clientes.",
  "about.p5": "Em seguida, ingressei na Group Software como Estagiário de Desenvolvimento de Software, com foco em backend e integrações de sistemas. Após o estágio, fui promovido a Desenvolvedor de Software Júnior, onde continuo trabalhando em melhorias e criação de sistemas usando tecnologias como .NET, C#, Java, Spring Boot e SQL Server.",
  "about.p6": "Sou um profissional em crescimento que busca proativamente novos desafios, aprimorando constantemente minhas habilidades por meio de estudos e projetos pessoais.",
  "about.p7": "Se quiser entrar em contato, me encontre no LinkedIn ou envie um e-mail para iagoalves.voador@gmail.com.",
  "about.signoff": "Atenciosamente, Iago",

  "notfound.title": "Esta página não existe.",
  "notfound.homeLink": "Me leve para casa, estrada..."
  ,
  "scroll.backToTop": "Voltar ao topo",
  "scroll.aria.scrollToTop": "Rolar para o topo"
  ,
  "footer.code": "Código",
  "footer.quote": "Uma coisa por vez :)"
}
